Дошкольное_учреждение83/src/Documents/удуКомплектованиеГруппы/удуКомплектованиеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуКомплектованиеГруппы</name>
  <registerRecords>InformationRegister.удуСведенияОКомплекатцииГруппы</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДоговораПоУмолчанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКомплектования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьКомплектация</name>
    <attributes>
      <name>ФормироватьДоговор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденВГруппу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>CatalogRef.удуРодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаПоДоговору</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорОЗачислении</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаЗачисление</name>
      <type>
        <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерЗаявки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументыСформированы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПереходаИзДругойГруппы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФормированияДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозрастнойПризнак</name>
      <type>
        <types>CatalogRef.удуВозрастныеПризнаки</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДляЗачисления</name>
      <type>
        <types>CatalogRef.удуГруппыУчреждения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/InformationRegisters/удуСведенияОКомплекатцииГруппы/удуСведенияОКомплекатцииГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСведенияОКомплекатцииГруппы</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодКомплектования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.удуВозрастныеПризнаки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Documents/удуКомплектованиеГруппы/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.удуСведенияОКомплекатцииГруппы.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧастьКомплектация Из ТабличнаяЧастьКомплектация Цикл
		
		Движение = Движения.удуСведенияОКомплекатцииГруппы.Добавить();
		Движение.Период = Дата;
		Движение.Учреждение = Учреждение;
		Движение.Группа = ТекСтрокаТабличнаяЧастьКомплектация.ГруппаДляЗачисления;
		Движение.Ребенок = ТекСтрокаТабличнаяЧастьКомплектация.Ребенок;
		Движение.ВозрастнойПризнак = ТекСтрокаТабличнаяЧастьКомплектация.ВозрастнойПризнак;
		Движение.ПериодКомплектования = ПериодКомплектования;
		Движение.Количество = 1;
	КонецЦикла;
	
КонецПроцедуры
